'''Задача на stepic: Реализуйте структуру данных, представляющую собой расширенную структуру стек.
Необходимо поддерживать добавление элемента на вершину стека,
удаление с вершины стека, и необходимо поддерживать операции сложения, вычитания, умножения и целочисленного деления. '''
class ExtendedStack(list):
    def sum(self):
        # операция сложения
        pass
    def sub(self):
        # операция вычитания
        pass
    def mul(self):
        # операция умножения
        pass
    def div(self):
        # операция целочисленного деления
        pass